---
kind: other
id: Properties.T:Autodesk.Revit.DB.DetailEllipse
source: html/c22d34f1-c7ee-91a8-7aec-18039121fc0e.htm
---
# DetailEllipse Properties

The id of the assembly instance to which the element belongs.